var dropList=[
  {
    "舰娘": {
      "驱逐": [
        "克雷文",
        "麦考尔",
        "彗星",
        "新月",
        "小天鹅"
      ]
    },
    "关卡": "1-1"
  },
  {
    "舰娘": {
      "驱逐": [
        "克雷文",
        "麦考尔",
        "奥利克",
        "富特",
        "斯彭斯",
        "彗星",
        "新月",
        "小天鹅",
        "狐提"
      ]
    },
    "关卡": "1-2"
  },
  {
    "舰娘": {
      "驱逐": [
        "新月",
        "唐斯",
        "克雷文",
        "麦考尔",
        "彗星",
        "小天鹅",
        "卡辛",
        "奥利克",
        "富特",
        "斯彭斯",
        "狐提"
      ]
    },
    "关卡": "1-3"
  },
  {
    "舰娘": {
      "驱逐": [
        "麦考尔",
        "狐提",
        "奥利克",
        "小天鹅",
        "富特",
        "新月",
        "卡辛",
        "唐斯",
        "克雷文",
        "斯彭斯",
        "彗星"
      ],
      "轻巡": [
        "利安得",
        "奥马哈",
        "罗利"
      ],
      "战巡": [
        "声望",
        "反击"
      ],
      "轻航": [
        "长岛"
      ]
    },
    "图纸": [
      "电动扬弹机T3",
      "三联装203mm主炮T3",
      "120mm单装炮T3（皇家）",
      "356mm连装炮T3",
      "单装127mm主炮T3"
    ],
    "关卡": "1-4"
  },
  {
    "舰娘": {
      "驱逐": [
        "拉菲",
        "Z23",
        "标枪",
        "狐提",
        "麦考尔",
        "天后",
        "唐斯",
        "卡辛",
        "彗星",
        "新月",
        "小天鹅",
        "克雷文"
      ],
      "轻巡": [
        "奥马哈",
        "利安得",
        "罗利"
      ],
      "重巡": [
        "伦敦",
        "彭萨科拉"
      ],
      "战列": [
        "田纳西",
        "加利福尼亚"
      ],
      "轻航": [
        "博格",
        "竞技神"
      ]
    },
    "图纸": [
      "液压舵机T3",
      "三联装356mm主炮T3",
      "单装152mm副炮T3",
      "双联装610mm鱼雷T3",
      "四联装20mm MG机枪T3"
    ],
    "关卡": "2-1"
  },
  {
    "舰娘": {
      "驱逐": [
        "拉菲",
        "Z23",
        "标枪",
        "格里德利",
        "克雷文",
        "麦考尔",
        "唐斯",
        "卡辛",
        "彗星",
        "新月",
        "小天鹅"
      ],
      "轻巡": [
        "布鲁克林",
        "奥马哈",
        "利安得",
        "罗利"
      ],
      "重巡": [
        "彭萨科拉"
      ],
      "战列": [
        "亚利桑那",
        "宾夕法尼亚",
        "内华达",
        "俄克拉荷马"
      ],
      "轻航": [
        "祥凤",
        "博格",
        "竞技神"
      ]
    },
    "图纸": [
      "海军迷彩T3",
      "20mm厄利空高射炮T3",
      "双联装40mm“砰砰”炮T3",
      "25mm高射机枪T3",
      "37mm手拉机枪T3"
    ],
    "关卡": "2-2"
  },
  {
    "舰娘": {
      "驱逐": [
        "拉菲",
        "Z23",
        "标枪",
        "撒切尔",
        "弗莱彻",
        "格里德利",
        "斯彭斯",
        "彗星",
        "卡辛",
        "唐斯",
        "奥利克",
        "富特",
        "小天鹅",
        "新月"
      ],
      "轻巡": [
        "奥马哈",
        "利安得",
        "罗利"
      ],
      "重巡": [
        "诺福克"
      ],
      "战列": [
        "纳尔逊",
        "内华达",
        "俄克拉荷马"
      ],
      "轻航": [
        "祥凤",
        "博格",
        "竞技神"
      ]
    },
    "图纸": [
      "对空雷达T3",
      "灭火器T3",
      "F2A水牛T3",
      "贼鸥T3",
      "九六式舰战T3"
    ],
    "关卡": "2-3"
  },
  {
    "舰娘": {
      "驱逐": [
        "拉菲",
        "Z23",
        "标枪",
        "富特",
        "克雷文",
        "麦考尔",
        "奥利克",
        "斯彭斯",
        "小猎兔犬",
        "大斗犬",
        "狐提"
      ],
      "轻巡": [
        "阿基里斯",
        "阿贾克斯",
        "奥马哈",
        "利安得",
        "罗利"
      ],
      "重巡": [
        "萨福克",
        "肯特"
      ],
      "战列": [
        "罗德尼",
        "内华达",
        "俄克拉荷马"
      ],
      "航母": [
        "列克星敦"
      ],
      "轻航": [
        "祥凤",
        "博格",
        "竞技神"
      ]
    },
    "图纸": [
      "单装SKC28式150mm主炮T3",
      "对空雷达T3",
      "三联装533mm鱼雷T3",
      "TBD蹂躏者T3",
      "120mm单装炮T3（重樱）",
      "九七式舰攻T3"
    ],
    "关卡": "2-4"
  },
  {
    "舰娘": {
      "驱逐": [
        "拉菲",
        "Z23",
        "标枪",
        "富特",
        "克雷文",
        "麦考尔",
        "奥利克",
        "斯彭斯",
        "小猎兔犬",
        "大斗犬"
      ],
      "轻巡": [
        "阿瑞托莎",
        "加拉蒂亚",
        "奥马哈",
        "利安得",
        "罗利"
      ],
      "重巡": [
        "休斯敦",
        "北安普敦",
        "芝加哥",
        "彭萨科拉"
      ],
      "战列": [
        "内华达",
        "俄克拉荷马"
      ],
      "航母": [
        "苍龙",
        "飞龙"
      ],
      "轻航": [
        "长岛",
        "兰利",
        "突击者"
      ]
    },
    "图纸": [
      "燃油滤清器T3",
      "F4F野猫T3",
      "12.7mm防空机枪T3",
      "SBD无畏T3",
      "140mm单装炮T3"
    ],
    "关卡": "3-1"
  },
  {
    "舰娘": {
      "驱逐": [
        "拉菲",
        "Z23",
        "标枪",
        "查尔斯·奥斯本",
        "命运女神",
        "西姆斯",
        "哈曼",
        "卡辛",
        "唐斯",
        "克雷文",
        "麦考尔",
        "狐提"
      ],
      "轻巡": [
        "阿瑞托莎",
        "加拉蒂亚",
        "奥马哈",
        "利安得",
        "罗利",
        "柯尼斯堡",
        "科隆",
        "卡尔斯鲁厄"
      ],
      "战列": [
        "内华达",
        "俄克拉荷马"
      ],
      "航母": [
        "苍龙",
        "飞龙"
      ],
      "轻航": [
        "兰利",
        "突击者"
      ]
    },
    "图纸": [
      "液压弹射装置T2",
      "127mm单装炮T3",
      "SB2C地狱俯冲者T3",
      "单装152mm主炮T3",
      "单装102mm副炮T3"
    ],
    "关卡": "3-2"
  },
  {
    "舰娘": {
      "驱逐": [
        "拉菲",
        "Z23",
        "标枪",
        "白露",
        "阳炎",
        "命运女神",
        "卡辛",
        "唐斯",
        "奥利克",
        "富特",
        "小猎兔犬",
        "大斗犬",
        "斯彭斯"
      ],
      "轻巡": [
        "阿基里斯",
        "阿贾克斯",
        "奥马哈",
        "罗利"
      ],
      "重巡": [
        "印第安纳波利斯",
        "古鹰",
        "加古"
      ],
      "战列": [
        "内华达",
        "俄克拉荷马"
      ],
      "航母": [
        "苍龙",
        "飞龙"
      ],
      "轻航": [
        "兰利",
        "突击者"
      ]
    },
    "图纸": [
      "四联装28mm“芝加哥钢琴”T3",
      "三联装610mm鱼雷T3",
      "九九式舰爆T3",
      "76mm火炮T3",
      "双联装102mm副炮T3"
    ],
    "关卡": "3-3"
  },
  {
    "舰娘": {
      "驱逐": [
        "拉菲",
        "Z23",
        "标枪",
        "天后",
        "弗莱彻",
        "撒切尔",
        "阳炎",
        "卡辛",
        "唐斯",
        "奥利克",
        "富特",
        "斯彭斯",
        "小猎兔犬",
        "大斗犬",
        "狐提"
      ],
      "轻巡": [
        "柯尼斯堡",
        "卡尔斯鲁厄",
        "科隆"
      ],
      "重巡": [
        "休斯敦",
        "波特兰"
      ],
      "战列": [
        "内华达",
        "俄克拉荷马"
      ],
      "航母": [
        "赤城",
        "加贺",
        "约克城"
      ],
      "轻航": [
        "兰利",
        "突击者"
      ]
    },
    "图纸": [
      "维修工具T3",
      "F4U海盗T3",
      "76mm高射炮T3",
      "零战二一型T3",
      "双联152mm主炮T3"
    ],
    "关卡": "3-4"
  },
  {
    "舰娘": {
      "驱逐": [
        "拉菲",
        "Z23",
        "标枪",
        "查尔斯·奥斯本",
        "西姆斯",
        "哈曼",
        "狐提",
        "不知火",
        "小猎兔犬",
        "大斗犬"
      ],
      "轻巡": [
        "布鲁克林",
        "菲尼克斯",
        "奥马哈",
        "罗利",
        "利安得",
        "柯尼斯堡",
        "卡尔斯鲁厄",
        "科隆"
      ],
      "重巡": [
        "波特兰"
      ],
      "战列": [
        "内华达",
        "俄克拉荷马"
      ],
      "航母": [
        "萨拉托加"
      ],
      "轻航": [
        "突击者",
        "博格",
        "竞技神"
      ]
    },
    "图纸": [
      "防鱼雷隔舱T3",
      "双联装134mm高炮T3",
      "三联装610mm鱼雷T3",
      "25mm连装高射机枪T3",
      "三联装SKC25式150mm主炮T3"
    ],
    "关卡": "4-1"
  },
  {
    "舰娘": {
      "驱逐": [
        "拉菲",
        "标枪",
        "Z23",
        "时雨",
        "撒切尔",
        "奥利克",
        "富特",
        "斯彭斯",
        "小猎兔犬",
        "大斗犬",
        "狐提",
        "不知火"
      ],
      "轻巡": [
        "利安得",
        "柯尼斯堡",
        "卡尔斯鲁厄",
        "科隆"
      ],
      "重巡": [
        "伦敦",
        "诺福克",
        "什罗普郡",
        "彭萨科拉"
      ],
      "战列": [
        "田纳西",
        "加利福尼亚"
      ],
      "轻航": [
        "博格",
        "兰利",
        "竞技神"
      ]
    },
    "图纸": [
      "三联装152mm主炮T3",
      "双联装120mm主炮T3",
      "四联装40mm“砰砰”炮T3",
      "203mm连装炮T3",
      "双联装TbtsKC36式150mm主炮T3"
    ],
    "关卡": "4-2"
  },
  {
    "舰娘": {
      "驱逐": [
        "拉菲",
        "标枪",
        "Z23",
        "白露",
        "阳炎",
        "卡辛",
        "唐斯",
        "小猎兔犬",
        "大斗犬",
        "狐提",
        "不知火"
      ],
      "轻巡": [
        "奥马哈",
        "罗利",
        "利安得"
      ],
      "重巡": [
        "波特兰",
        "肯特",
        "萨福克",
        "彭萨科拉"
      ],
      "战列": [
        "内华达",
        "俄克拉荷马"
      ],
      "轻航": [
        "兰利",
        "突击者",
        "竞技神"
      ],
      "重炮": [
        "黑暗界",
        "恐怖"
      ]
    },
    "图纸": [
      "火控雷达T3",
      "三联装203mm主炮改进型T3",
      "双联装152mm主炮T3",
      "25mm三连装高射机枪T3",
      "双联装203mmSKC主炮T2"
    ],
    "关卡": "4-3"
  },
  {
    "舰娘": {
      "驱逐": [
        "拉菲",
        "标枪",
        "Z23",
        "女将",
        "格里德利",
        "卡辛",
        "唐斯",
        "克雷文",
        "麦考尔",
        "小猎兔犬",
        "大斗犬",
        "不知火"
      ],
      "轻巡": [
        "克利夫兰",
        "菲尼克斯"
      ],
      "重巡": [
        "印第安纳波利斯",
        "北安普敦",
        "芝加哥",
        "彭萨科拉",
        "古鹰",
        "加古"
      ],
      "战列": [
        "内华达",
        "俄克拉荷马"
      ],
      "轻航": [
        "独角兽",
        "博格",
        "兰利",
        "突击者"
      ]
    },
    "图纸": [
      "四联装610mm鱼雷T2",
      "双联装203mm主炮T3",
      "140mm连装炮T3",
      "127mm连装高射炮T3",
      "双联装203mmSKC主炮T2"
    ],
    "关卡": "4-4"
  },
  {
    "舰娘": {
      "驱逐": [
        "拉菲",
        "标枪",
        "Z23",
        "Z1",
        "女将",
        "彗星",
        "新月",
        "小天鹅"
      ],
      "轻巡": [
        "海伦娜",
        "布鲁克林",
        "菲尼克斯",
        "奥马哈",
        "罗利",
        "柯尼斯堡",
        "卡尔斯鲁厄",
        "科隆"
      ],
      "重巡": [
        "彭萨科拉",
        "妙高"
      ],
      "战列": [
        "内华达",
        "俄克拉荷马",
        "宾夕法尼亚"
      ],
      "轻航": [
        "长岛",
        "兰利",
        "博格",
        "突击者",
        "竞技神"
      ]
    },
    "图纸": [
      "双联装127mm高平两用炮MK12T3",
      "改良锅炉T3",
      "双联装127mm高平两用炮MK12T2",
      "TBF复仇者T3",
      "零战五二型T2"
    ],
    "关卡": "5-1"
  },
  {
    "舰娘": {
      "驱逐": [
        "拉菲",
        "标枪",
        "Z23",
        "萤火虫",
        "奥利克",
        "富特",
        "斯彭斯",
        "小猎兔犬",
        "大斗犬"
      ],
      "轻巡": [
        "朱诺",
        "亚特兰大",
        "柯尼斯堡",
        "卡尔斯鲁厄",
        "科隆"
      ],
      "重巡": [
        "什罗普郡",
        "彭萨科拉"
      ],
      "战列": [
        "伊丽莎白女王",
        "加利福尼亚",
        "田纳西",
        "内华达",
        "俄克拉荷马"
      ],
      "轻航": [
        "博格",
        "兰利",
        "突击者",
        "竞技神"
      ]
    },
    "图纸": [
      "F6F地狱猫T3",
      "四联装533mm鱼雷T3",
      "双管20mm厄利空高射炮T3",
      "F6F地狱猫T2",
      "彗星T2"
    ],
    "关卡": "5-2"
  },
  {
    "舰娘": {
      "驱逐": [
        "拉菲",
        "标枪",
        "Z23",
        "命运女神",
        "天后",
        "彗星",
        "新月",
        "小天鹅"
      ],
      "轻巡": [
        "克利夫兰",
        "阿基里斯",
        "阿贾克斯",
        "柯尼斯堡",
        "卡尔斯鲁厄",
        "科隆"
      ],
      "重巡": [
        "彭萨科拉",
        "加古",
        "古鹰"
      ],
      "战巡": [
        "反击"
      ],
      "战列": [
        "内华达",
        "俄克拉荷马"
      ],
      "航母": [
        "大黄蜂"
      ],
      "轻航": [
        "博格",
        "兰利",
        "突击者",
        "竞技神"
      ]
    },
    "图纸": [
      "BTD-1毁灭者T3",
      "航空副油箱T3",
      "双联40mm博福斯对空机炮T3",
      "BTD-1毁灭者T2",
      "102mm高射炮T3"
    ],
    "关卡": "5-3"
  },
  {
    "舰娘": {
      "驱逐": [
        "拉菲",
        "标枪",
        "Z23",
        "女将",
        "小猎兔犬",
        "大斗犬",
        "彗星",
        "新月",
        "小天鹅"
      ],
      "轻巡": [
        "布鲁克林",
        "菲尼克斯",
        "柯尼斯堡",
        "卡尔斯鲁厄",
        "科隆"
      ],
      "重巡": [
        "什罗普郡",
        "波特兰",
        "彭萨科拉"
      ],
      "战列": [
        "纳尔逊",
        "罗德尼",
        "内华达",
        "俄克拉荷马"
      ],
      "轻航": [
        "独角兽",
        "博格",
        "兰利",
        "突击者",
        "竞技神"
      ]
    },
    "图纸": [
      "四联40mm博福斯对空机炮T3",
      "舰艇维修设备T2",
      "四联40mm博福斯对空机炮T2",
      "八联装40mm“砰砰”炮T2",
      "天山T3"
    ],
    "关卡": "5-4"
  },
  {
    "舰娘": {
      "驱逐": [
        "拉菲",
        "标枪",
        "Z23",
        "雷",
        "电",
        "弗莱彻",
        "撒切尔",
        "奥利克",
        "富特",
        "斯彭斯",
        "小猎兔犬",
        "大斗犬",
        "命运女神"
      ],
      "轻巡": [
        "海伦娜",
        "柯尼斯堡",
        "卡尔斯鲁厄",
        "科隆"
      ],
      "重巡": [
        "什罗普郡",
        "诺福克",
        "彭萨科拉"
      ],
      "战列": [
        "内华达",
        "俄克拉荷马"
      ],
      "轻航": [
        "博格",
        "兰利",
        "突击者",
        "竞技神"
      ],
      "维修": [
        "女灶神"
      ]
    },
    "图纸": [
      "SG雷达T3",
      "SG雷达T2",
      "双联装406mm主炮MK5T3",
      "双联100mm98式高射炮T2",
      "毘式40mm连装机枪T3"
    ],
    "关卡": "6-1"
  },
  {
    "舰娘": {
      "驱逐": [
        "拉菲",
        "标枪",
        "Z23",
        "天后",
        "白露",
        "女将",
        "奥利克",
        "富特",
        "斯彭斯",
        "小猎兔犬",
        "大斗犬"
      ],
      "轻巡": [
        "柯尼斯堡",
        "卡尔斯鲁厄",
        "科隆"
      ],
      "重巡": [
        "约克",
        "埃克塞特",
        "彭萨科拉"
      ],
      "战列": [
        "扶桑",
        "山城",
        "内华达",
        "俄克拉荷马"
      ],
      "轻航": [
        "博格",
        "兰利",
        "突击者",
        "竞技神"
      ]
    },
    "图纸": [
      "155mm三连装炮T3",
      "陀螺仪T3",
      "三联装406mm主炮MK6T3",
      "双联装381mm主炮T3",
      "155mm三连装炮T2"
    ],
    "关卡": "6-2"
  },
  {
    "舰娘": {
      "驱逐": [
        "夕立",
        "拉菲",
        "标枪",
        "Z23",
        "电",
        "克雷文",
        "麦考尔",
        "彗星",
        "新月",
        "小天鹅"
      ],
      "轻巡": [
        "亚特兰大",
        "朱诺",
        "利安得"
      ],
      "重巡": [
        "彭萨科拉",
        "古鹰",
        "加古"
      ],
      "战列": [
        "亚利桑那",
        "扶桑",
        "山城",
        "宾夕法尼亚",
        "内华达",
        "俄克拉荷马"
      ],
      "航母": [
        "皇家方舟"
      ],
      "轻航": [
        "博格",
        "兰利",
        "突击者",
        "竞技神"
      ]
    },
    "图纸": [
      "三联装406mm主炮T3",
      "链式装弹机T3",
      "双联装406mm主炮MK5T3",
      "三联装406mm主炮MK6T3",
      "410mm连装炮T3"
    ],
    "关卡": "6-3"
  },
  {
    "舰娘": {
      "驱逐": [
        "夕立",
        "拉菲",
        "标枪",
        "Z23",
        "萤火虫",
        "奥利克",
        "富特",
        "斯彭斯"
      ],
      "轻巡": [
        "奥马哈",
        "罗利",
        "柯尼斯堡",
        "卡尔斯鲁厄",
        "科隆"
      ],
      "重巡": [
        "北安普敦",
        "芝加哥",
        "彭萨科拉"
      ],
      "战巡": [
        "反击"
      ],
      "战列": [
        "扶桑",
        "山城",
        "内华达",
        "俄克拉荷马"
      ],
      "航母": [
        "列克星敦",
        "萨拉托加"
      ],
      "轻航": [
        "博格",
        "兰利",
        "突击者",
        "竞技神"
      ]
    },
    "图纸": [
      "四联装610mm鱼雷T3",
      "五联装533mm鱼雷T2",
      "127mm连装炮T3",
      "四联装610mm鱼雷T2",
      "双联105mmSKC高炮T2"
    ],
    "关卡": "6-4"
  },
  {
    "舰娘": {
      "驱逐": [
        "拉菲",
        "标枪",
        "Z23",
        "时雨",
        "白露",
        "弗莱彻",
        "格里德利",
        "小天鹅",
        "卡辛",
        "唐斯",
        "彗星",
        "新月"
      ],
      "轻巡": [
        "柯尼斯堡",
        "卡尔斯鲁厄",
        "科隆"
      ],
      "重巡": [
        "彭萨科拉",
        "肯特",
        "萨福克"
      ],
      "战列": [
        "伊丽莎白女王",
        "内华达",
        "俄克拉荷马"
      ],
      "轻航": [
        "博格",
        "兰利",
        "突击者",
        "竞技神"
      ]
    },
    "图纸": [
      "八联装40mm“砰砰”炮T3",
      "三联装102mm副炮T3",
      "海喷火T3",
      "剑鱼T3",
      "海燕T3"
    ],
    "关卡": "7-1"
  },
  {
    "舰娘": {
      "驱逐": [
        "拉菲",
        "标枪",
        "Z23",
        "雷",
        "电",
        "卡辛",
        "小天鹅",
        "唐斯",
        "彗星",
        "新月"
      ],
      "轻巡": [
        "朱诺",
        "亚特兰大",
        "柯尼斯堡",
        "卡尔斯鲁厄",
        "科隆"
      ],
      "重巡": [
        "北安普敦",
        "芝加哥",
        "彭萨科拉"
      ],
      "战列": [
        "内华达",
        "俄克拉荷马"
      ],
      "航母": [
        "约克城",
        "大黄蜂"
      ],
      "轻航": [
        "长岛",
        "博格",
        "兰利",
        "突击者",
        "竞技神"
      ]
    },
    "图纸": [
      "双联装113mm高射炮T3",
      "液压弹射装置T2",
      "双联装113mm高射炮T2",
      "梭鱼T2",
      "155mm三连装炮T2",
      "双联37mm手拉机枪T3"
    ],
    "关卡": "7-2"
  },
  {
    "舰娘": {
      "驱逐": [
        "拉菲",
        "标枪",
        "Z23",
        "西姆斯",
        "哈曼",
        "克雷文",
        "麦考尔",
        "奥利克",
        "富特",
        "斯彭斯"
      ],
      "轻巡": [
        "阿瑞托莎",
        "加拉蒂亚",
        "五十铃",
        "科隆",
        "卡尔斯鲁厄",
        "柯尼斯堡"
      ],
      "重巡": [
        "彭萨科拉"
      ],
      "战巡": [
        "声望",
        "反击"
      ],
      "战列": [
        "内华达",
        "俄克拉荷马"
      ],
      "轻航": [
        "突击者",
        "博格",
        "兰利",
        "竞技神"
      ],
      "维修": [
        "女灶神"
      ]
    },
    "图纸": [
      "双联装203mmSKC主炮T3",
      "三联装203mm主炮改进型T3",
      "四联装356mm主炮T2",
      "双联100mm98式高射炮T2",
      "410mm连装炮T3"
    ],
    "关卡": "7-3"
  },
  {
    "舰娘": {
      "驱逐": [
        "拉菲",
        "标枪",
        "Z23",
        "西姆斯",
        "哈曼",
        "阳炎",
        "奥利克",
        "富特",
        "斯彭斯"
      ],
      "轻巡": [
        "阿瑞托莎",
        "加拉蒂亚",
        "奥马哈",
        "罗利",
        "柯尼斯堡",
        "卡尔斯鲁厄",
        "科隆"
      ],
      "重巡": [
        "彭萨科拉"
      ],
      "战列": [
        "内华达",
        "俄克拉荷马"
      ],
      "轻航": [
        "凤翔",
        "博格",
        "兰利",
        "突击者",
        "竞技神"
      ],
      "重炮": [
        "黑暗界",
        "恐怖"
      ]
    },
    "图纸": [
      "五联装533mm鱼雷T3",
      "防鱼雷隔舱T3",
      "SG雷达T2",
      "三联装406mm主炮T2",
      "海毒牙T2"
    ],
    "关卡": "7-4"
  },
  {
    "舰娘": {
      "驱逐": [
        "拉菲",
        "标枪",
        "Z23",
        "电",
        "小猎兔犬",
        "大斗犬",
        "克雷文",
        "卡辛",
        "唐斯",
        "麦考尔",
        "狐提"
      ],
      "轻巡": [
        "利安得",
        "阿武隈",
        "朱诺",
        "亚特兰大"
      ],
      "重巡": [
        "约克",
        "埃克塞特",
        "肯特",
        "萨福克"
      ],
      "战列": [
        "内华达",
        "俄克拉荷马",
        "宾夕法尼亚"
      ],
      "轻航": [
        "兰利",
        "竞技神",
        "博格",
        "突击者"
      ]
    },
    "图纸": [
      "双联装127mm高平两用炮MK12T3",
      "双联装120mm主炮T3",
      "127mm连装炮T3",
      "140mm连装炮T3",
      "单装SKC28式150mm主炮T3"
    ],
    "关卡": "8-1"
  },
  {
    "舰娘": {
      "驱逐": [
        "拉菲",
        "标枪",
        "Z23",
        "Z1",
        "雷",
        "卡辛",
        "唐斯",
        "麦考尔",
        "克雷文",
        "小猎兔犬",
        "大斗犬",
        "狐提"
      ],
      "轻巡": [
        "阿贾克斯",
        "阿基里斯",
        "阿武隈",
        "利安得"
      ],
      "重巡": [
        "印第安纳波利斯",
        "诺福克"
      ],
      "战列": [
        "内华达",
        "俄克拉荷马",
        "加利福尼亚",
        "田纳西"
      ],
      "轻航": [
        "博格",
        "兰利",
        "突击者",
        "竞技神"
      ]
    },
    "图纸": [
      "四联装610mm鱼雷T3",
      "四联装40mm“砰砰”炮T3",
      "双联100mm98式高射炮T2",
      "140mm连装炮T3",
      "三联装610mm鱼雷T3"
    ],
    "关卡": "8-2"
  },
  {
    "舰娘": {
      "驱逐": [
        "拉菲",
        "标枪",
        "Z23",
        "查尔斯·奥斯本",
        "萤火虫",
        "卡辛",
        "唐斯",
        "克雷文",
        "麦考尔",
        "小猎兔犬",
        "大斗犬",
        "狐提"
      ],
      "轻巡": [
        "布鲁克林",
        "菲尼克斯",
        "阿瑞托莎",
        "加拉蒂亚",
        "阿武隈",
        "利安得"
      ],
      "重巡": [
        "那智",
        "盐湖城"
      ],
      "战列": [
        "内华达",
        "俄克拉荷马"
      ],
      "轻航": [
        "博格",
        "兰利",
        "竞技神"
      ]
    },
    "图纸": [
      "155mm三连装炮T3",
      "三联装203mm主炮改进型T3",
      "76mm高射炮T3",
      "203mm连装炮T3",
      "双联37mm手拉机枪T3"
    ],
    "关卡": "8-3"
  },
  {
    "舰娘": {
      "驱逐": [
        "拉菲",
        "标枪",
        "Z23",
        "卡辛",
        "唐斯",
        "克雷文",
        "麦考尔",
        "小猎兔犬",
        "大斗犬"
      ],
      "轻巡": [
        "利安得",
        "阿武隈",
        "里士满"
      ],
      "重巡": [
        "摩耶",
        "约克",
        "埃克塞特",
        "什罗普郡",
        "肯特",
        "萨福克",
        "诺福克",
        "那智",
        "盐湖城"
      ],
      "战列": [
        "内华达",
        "俄克拉荷马"
      ],
      "轻航": [
        "兰利",
        "博格",
        "竞技神",
        "突击者"
      ]
    },
    "图纸": [
      "双联装203mmSKC主炮T3",
      "三联装203mm主炮改进型T3",
      "双联装203mm主炮T3",
      "203mm连装炮T3",
      "双联装203mmSKC主炮T2"
    ],
    "关卡": "8-4"
  },
  {
    "舰娘": {
      "驱逐": [
        "拉菲",
        "标枪",
        "Z23",
        "查尔斯·奥斯本",
        "弗莱彻",
        "撒切尔",
        "奥利克",
        "富特",
        "斯彭斯",
        "大斗犬",
        "小猎兔犬"
      ],
      "轻巡": [
        "阿贾克斯",
        "阿基里斯",
        "奥马哈",
        "罗利",
        "利安得",
        "里士满"
      ],
      "战列": [
        "亚利桑那",
        "宾夕法尼亚",
        "俄克拉荷马",
        "内华达"
      ],
      "轻航": [
        "突击者",
        "兰利",
        "博格",
        "竞技神"
      ]
    },
    "图纸": [
      "双联105mmSKC高炮T3",
      "改良锅炉T3",
      "TBF复仇者T3",
      "八联装40mm“砰砰”炮T2",
      "25mm三连装高射机枪T3"
    ],
    "关卡": "9-1"
  },
  {
    "舰娘": {
      "驱逐": [
        "拉菲",
        "标枪",
        "Z23",
        "拉德福特",
        "杰金斯",
        "阳炎",
        "奥利克",
        "富特",
        "斯彭斯",
        "小猎兔犬",
        "大斗犬"
      ],
      "轻巡": [
        "阿瑞托莎",
        "加拉蒂亚",
        "利安得",
        "奥马哈",
        "罗利",
        "里士满"
      ],
      "战列": [
        "内华达",
        "俄克拉荷马"
      ],
      "轻航": [
        "博格",
        "兰利",
        "突击者",
        "竞技神"
      ],
      "重炮": [
        "黑暗界",
        "恐怖"
      ]
    },
    "图纸": [
      "舰艇维修设备T3",
      "舰艇维修设备T2",
      "燃油滤清器T3",
      "双管20mm厄利空高射炮T3",
      "四联装28mm“芝加哥钢琴”T3"
    ],
    "关卡": "9-2"
  },
  {
    "舰娘": {
      "驱逐": [
        "尼古拉斯",
        "拉菲",
        "标枪",
        "Z23",
        "时雨",
        "萤火虫",
        "女将",
        "命运女神",
        "天后",
        "奥利克",
        "富特",
        "斯彭斯",
        "小猎兔犬",
        "大斗犬"
      ],
      "轻巡": [
        "亚特兰大",
        "朱诺",
        "奥马哈",
        "罗利",
        "里士满",
        "利安得"
      ],
      "战列": [
        "内华达",
        "俄克拉荷马"
      ],
      "轻航": [
        "博格",
        "兰利",
        "突击者",
        "竞技神"
      ]
    },
    "图纸": [
      "零战五二型T3",
      "F4F野猫T3",
      "双联装134mm高炮T3",
      "零战五二型T2",
      "双联装TbtsKC36式150mm主炮T3"
    ],
    "关卡": "9-3"
  },
  {
    "舰娘": {
      "驱逐": [
        "新月JP",
        "拉菲",
        "标枪",
        "Z23",
        "Z1",
        "白露",
        "阳炎",
        "奥利克",
        "富特",
        "斯彭斯",
        "小猎兔犬",
        "大斗犬"
      ],
      "轻巡": [
        "海伦娜",
        "布鲁克林",
        "菲尼克斯",
        "奥马哈",
        "罗利",
        "里士满",
        "利安得"
      ],
      "战列": [
        "内华达",
        "俄克拉荷马"
      ],
      "轻航": [
        "长岛",
        "博格",
        "兰利",
        "突击者",
        "竞技神"
      ]
    },
    "图纸": [
      "双联100mm98式高射炮T3",
      "三联装152mm主炮T3",
      "双联40mm博福斯对空机炮T3",
      "三联装406mm主炮T2",
      "零战二一型T3"
    ],
    "关卡": "9-4"
  },
  {
    "舰娘": {
      "驱逐": [
        "拉菲",
        "标枪",
        "Z23",
        "女将",
        "彗星",
        "新月",
        "小天鹅",
        "水无月",
        "三日月"
      ],
      "轻巡": [
        "奥马哈",
        "罗利",
        "里士满",
        "利安得"
      ],
      "重巡": [
        "休斯敦",
        "妙高",
        "那智"
      ],
      "战列": [
        "田纳西",
        "加利福尼亚",
        "内华达",
        "俄克拉荷马"
      ],
      "轻航": [
        "独角兽",
        "博格",
        "兰利",
        "突击者",
        "竞技神"
      ]
    },
    "图纸": [
      "双联105mmSKC高炮T3",
      "链式装弹机T3",
      "127mm单装炮T3",
      "双联装152mm主炮T3",
      "127mm连装炮T3"
    ],
    "关卡": "10-1"
  },
  {
    "舰娘": {
      "驱逐": [
        "拉菲",
        "标枪",
        "Z23",
        "格里德利",
        "彗星",
        "新月",
        "小天鹅",
        "水无月",
        "三日月"
      ],
      "轻巡": [
        "火奴鲁鲁",
        "奥马哈",
        "罗利",
        "里士满",
        "利安得"
      ],
      "重巡": [
        "北安普敦",
        "芝加哥"
      ],
      "战巡": [
        "反击"
      ],
      "战列": [
        "内华达",
        "俄克拉荷马"
      ],
      "航母": [
        "列克星敦",
        "萨拉托加"
      ],
      "轻航": [
        "博格",
        "兰利",
        "突击者",
        "竞技神"
      ]
    },
    "图纸": [
      "SG雷达T3",
      "防鱼雷隔舱T3",
      "陀螺仪T3",
      "三联装152mm主炮T3",
      "双联40mm博福斯对空机炮T3"
    ],
    "关卡": "10-2"
  },
  {
    "舰娘": {
      "驱逐": [
        "拉菲",
        "标枪",
        "Z23",
        "西姆斯",
        "哈曼",
        "命运女神",
        "天后",
        "彗星",
        "新月",
        "小天鹅",
        "水无月",
        "三日月"
      ],
      "轻巡": [
        "圣路易斯",
        "奥马哈",
        "罗利",
        "里士满",
        "利安得"
      ],
      "重巡": [
        "波特兰"
      ],
      "战列": [
        "纳尔逊",
        "罗德尼",
        "内华达",
        "俄克拉荷马"
      ],
      "轻航": [
        "博格",
        "兰利",
        "突击者",
        "竞技神"
      ]
    },
    "图纸": [
      "双联装127mm高平两用炮MK12T3",
      "火控雷达T3",
      "维修工具T3",
      "三联装152mm主炮T3",
      "双联40mm博福斯对空机炮T3"
    ],
    "关卡": "10-3"
  },
  {
    "舰娘": {
      "驱逐": [
        "拉菲",
        "标枪",
        "Z23",
        "撒切尔",
        "彗星",
        "新月",
        "小天鹅",
        "水无月",
        "三日月"
      ],
      "轻巡": [
        "神通",
        "奥马哈",
        "罗利",
        "里士满",
        "利安得"
      ],
      "重巡": [
        "伦敦",
        "什罗普郡",
        "肯特",
        "萨福克",
        "诺福克"
      ],
      "战列": [
        "伊丽莎白女王",
        "内华达",
        "俄克拉荷马"
      ],
      "轻航": [
        "博格",
        "兰利",
        "突击者",
        "竞技神"
      ]
    },
    "图纸": [
      "四联装610mm鱼雷T3",
      "燃油滤清器T3",
      "140mm连装炮T3",
      "四联装610mm鱼雷T2",
      "25mm三连装高射机枪T3"
    ],
    "关卡": "10-4"
  },
  {
    "舰娘": {
      "驱逐": [
        "标枪",
        "拉菲",
        "Z23",
        "西姆斯",
        "哈曼",
        "格里德利",
        "弗莱彻",
        "彗星",
        "新月",
        "小天鹅",
        "克雷文",
        "麦考尔"
      ],
      "轻巡": [
        "奥马哈",
        "罗利",
        "里士满",
        "利安得"
      ],
      "重巡": [
        "休斯敦"
      ],
      "战列": [
        "亚利桑那",
        "宾夕法尼亚",
        "俄克拉荷马",
        "内华达"
      ],
      "轻航": [
        "博格",
        "兰利",
        "突击者",
        "竞技神"
      ]
    },
    "图纸": [
      "双联装127mm高平两用炮MK12T3",
      "液压弹射装置T2",
      "127mm单装炮T3",
      "双联装127mm高平两用炮MK12T2",
      "102mm高射炮T3"
    ],
    "关卡": "11-1"
  },
  {
    "舰娘": {
      "驱逐": [
        "拉菲",
        "标枪",
        "Z23",
        "萤火虫",
        "彗星",
        "新月",
        "小天鹅",
        "克雷文",
        "麦考尔"
      ],
      "轻巡": [
        "阿贺野",
        "阿瑞托莎",
        "加拉蒂亚",
        "奥马哈",
        "罗利",
        "里士满",
        "利安得"
      ],
      "重巡": [
        "约克",
        "埃克塞特"
      ],
      "战列": [
        "加利福尼亚",
        "田纳西",
        "内华达",
        "俄克拉荷马"
      ],
      "轻航": [
        "兰利",
        "突击者",
        "博格",
        "竞技神"
      ]
    },
    "图纸": [
      "四联装610mm鱼雷T3",
      "SG雷达T2",
      "F4U海盗T3",
      "四联装610mm鱼雷T2",
      "单装SKC28式150mm主炮T3"
    ],
    "关卡": "11-2"
  },
  {
    "舰娘": {
      "驱逐": [
        "标枪",
        "拉菲",
        "Z23",
        "新月",
        "彗星",
        "小天鹅",
        "克雷文",
        "麦考尔"
      ],
      "轻巡": [
        "克利夫兰",
        "川内",
        "阿基里斯",
        "阿贾克斯",
        "亚特兰大",
        "朱诺",
        "利安得",
        "奥马哈",
        "罗利",
        "里士满"
      ],
      "战列": [
        "内华达",
        "俄克拉荷马"
      ],
      "轻航": [
        "竞技神",
        "兰利",
        "博格",
        "突击者"
      ],
      "维修": [
        "女灶神"
      ]
    },
    "图纸": [
      "四联40mm博福斯对空机炮T3",
      "链式装弹机T3",
      "F6F地狱猫T2",
      "140mm连装炮T3",
      "三联装SKC25式150mm主炮T3"
    ],
    "关卡": "11-3"
  },
  {
    "舰娘": {
      "驱逐": [
        "拉菲",
        "标枪",
        "Z23",
        "彗星",
        "新月",
        "小天鹅",
        "克雷文",
        "麦考尔"
      ],
      "轻巡": [
        "哥伦比亚",
        "奥马哈",
        "罗利",
        "里士满",
        "利安得"
      ],
      "重巡": [
        "印第安纳波利斯",
        "北安普敦",
        "芝加哥",
        "波特兰"
      ],
      "战巡": [
        "声望",
        "反击"
      ],
      "战列": [
        "内华达",
        "俄克拉荷马"
      ],
      "轻航": [
        "长岛",
        "博格",
        "兰利",
        "突击者",
        "竞技神"
      ]
    },
    "图纸": [
      "双联装113mm高射炮T3",
      "三联装152mm主炮T3",
      "SB2C地狱俯冲者T3",
      "双联装113mm高射炮T2",
      "双联装TbtsKC36式150mm主炮T3"
    ],
    "关卡": "11-4"
  },
  {
    "舰娘": {
      "驱逐": [
        "标枪",
        "拉菲",
        "Z23",
        "弗莱彻",
        "撒切尔",
        "命运女神",
        "天后",
        "格里德利",
        "卡辛",
        "唐斯",
        "大斗犬",
        "小猎兔犬",
        "狐提"
      ],
      "轻巡": [
        "海伦娜",
        "科隆",
        "柯尼斯堡",
        "卡尔斯鲁厄",
        "利安得"
      ],
      "战列": [
        "内华达",
        "俄克拉荷马"
      ],
      "轻航": [
        "独角兽",
        "竞技神",
        "兰利",
        "博格",
        "突击者"
      ]
    },
    "图纸": [
      "零战五二型T3",
      "203mm连装炮T3",
      "25mm连装高射机枪T3",
      "零战二一型T3",
      "零战五二型T2"
    ],
    "关卡": "12-1"
  },
  {
    "舰娘": {
      "驱逐": [
        "标枪",
        "拉菲",
        "Z23",
        "西姆斯",
        "哈曼",
        "卡辛",
        "唐斯",
        "小猎兔犬",
        "大斗犬",
        "狐提"
      ],
      "轻巡": [
        "克利夫兰",
        "朱诺",
        "亚特兰大",
        "利安得",
        "柯尼斯堡",
        "卡尔斯鲁厄",
        "科隆"
      ],
      "战列": [
        "内华达",
        "俄克拉荷马"
      ],
      "轻航": [
        "飞鹰",
        "竞技神",
        "兰利",
        "博格",
        "突击者"
      ],
      "维修": [
        "女灶神"
      ]
    },
    "图纸": [
      "四联装610mm鱼雷T3",
      "127mm连装炮T3",
      "140mm连装炮T3",
      "四联装610mm鱼雷T2",
      "25mm三连装高射机枪T3"
    ],
    "关卡": "12-2"
  },
  {
    "舰娘": {
      "驱逐": [
        "标枪",
        "拉菲",
        "Z23",
        "卡辛",
        "唐斯",
        "小猎兔犬",
        "大斗犬",
        "狐提"
      ],
      "轻巡": [
        "布鲁克林",
        "菲尼克斯",
        "阿基里斯",
        "阿贾克斯",
        "利安得",
        "柯尼斯堡",
        "卡尔斯鲁厄",
        "科隆"
      ],
      "战列": [
        "内华达",
        "俄克拉荷马"
      ],
      "航母": [
        "列克星敦",
        "萨拉托加"
      ],
      "轻航": [
        "隼鹰",
        "博格",
        "兰利",
        "突击者",
        "竞技神"
      ]
    },
    "图纸": [
      "彗星T3",
      "155mm三连装炮T2",
      "毘式40mm连装机枪T3",
      "九九式舰爆T3",
      "彗星T2"
    ],
    "关卡": "12-3"
  },
  {
    "舰娘": {
      "驱逐": [
        "标枪",
        "拉菲",
        "Z23",
        "卡辛",
        "唐斯",
        "小猎兔犬",
        "大斗犬",
        "狐提"
      ],
      "轻巡": [
        "利安得",
        "卡尔斯鲁厄",
        "柯尼斯堡",
        "科隆"
      ],
      "重巡": [
        "鸟海",
        "伦敦",
        "什罗普郡",
        "肯特",
        "萨福克",
        "诺福克",
        "印第安纳波利斯",
        "波特兰"
      ],
      "战列": [
        "内华达",
        "俄克拉荷马"
      ],
      "轻航": [
        "竞技神",
        "兰利",
        "博格",
        "突击者"
      ]
    },
    "图纸": [
      "双联100mm98式高射炮T3",
      "双联100mm98式高射炮T2",
      "410mm连装炮T3",
      "127mm连装高射炮T3",
      "天山T3"
    ],
    "关卡": "12-4"
  }
];